tests/interFSFFoam/bubbleRelaxation/src/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.liquid.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 2;

        MULESCorr       yes;
        nLimiterIter    5;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;

        nAlphaSmoothers     3;
        cSmCoeff            0.5;
        cShCoeff            0.9;
        nKappaSmoothers     2;
        cPhicThresholdCoeff 0.01;
        cPhicRelaxCoeff     0.7;
    }

    pcorr
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0;
    }

    pcorrFinal
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0;
    }

    p_rgh
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          1e-2;
    }

    p_rghFinal
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
    }

    pc
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          1e-2;
    }

    pcFinal
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
    }

    "U.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor           no;
    nOuterCorrectors            2;
    nCorrectors                 2;
    nNonOrthogonalCorrectors    2;
    consistent                  no;

    outerCorrectorResidualControl
    {
        p_rgh
        {
            tolerance           1e-5;
            relTol              0;
        }

        U
        {
            tolerance           1e-5;
            relTol              0;
        }
    }

//     residualControl
//     {
//         p_rgh                   1e-4;
//         U                       1e-4;
//         T                       1e-4;
//     }

    turbOnFinalIterOnly on;
}

relaxationFactors
{
    fields
    {
//         p_rgh                   0.5;
//         p_rghFinal              1;
    }
    equations
    {
//         "(U|k|epsilon|omega).*" 1;
//         UFinal                  1;
        ".*" 1;
    }
}


// ************************************************************************* //
